       IDENTIFICATION DIVISION.
       PROGRAM-ID. FACTORIAL.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 N        PIC 9(02) VALUE 10.
       01 I        PIC 9(02) VALUE 1.
       01 RESULT   PIC 9(18) VALUE 1.

       PROCEDURE DIVISION.
           PERFORM VARYING I FROM 2 BY 1 UNTIL I > N
               MULTIPLY RESULT BY I GIVING RESULT
           END-PERFORM

           DISPLAY "FACTORIAL(" N ") = " RESULT
           STOP RUN.
